src/Documents/ИС_Ozon_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Ozon_УпаковкаТоваров</Name>
			<Comment>ИнфоСофт Власова И.С. 22.03.24 УА #71520</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобиратьПозаказно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПечатиШтрихкодов</Name>
					<Comment>ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СтатусыСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СтатусыСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_СтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>substatus</Name>
					<Comment>ИнфоСофт Прокопцов Д. И. 03.03.2025 УА #93657</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ДетальныеСтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>posting_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>recommended_shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cancelled_after_ship</Name>
					<Comment>ИнфоСофт Прокопцов Д. И. 04.03.2025 УА #93657</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ДанныеВыгрузкиКИЗов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ДанныеВыгрузкиКИЗов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыгруженныхТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказМП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_АЛИ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_СтатусыОтправлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_СтатусыОтправлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>acceptance_in_progress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>arbitration</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_approve</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_deliver</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_packaging</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_registration</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_verification</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>cancelled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>cancelled_from_split_pending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>client_arbitration</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>delivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>delivering</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>driver_pickup</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>not_accepted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>sent_by_seller</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_Ozon_Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_Штрихкоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_Ozon_Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_Ozon_УпаковкаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы   

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("Профиль") Тогда	
			Объект.Профиль = Параметры.Профиль;
		КонецЕсли;
		
		МассивЗаказов = Новый Массив;
		
		Если Параметры.Свойство("ВыделенныеСтроки") Тогда
			МассивЗаказов = Параметры.ВыделенныеСтроки;
		КонецЕсли;
		
		ЗаполнитьДанныеЗаказаНаСервере(МассивЗаказов);
		
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
	Иначе		
		ЗаполнитьДеревоНоменклатурыПоТЧ();	
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
	СканированиеДоступно = Истина;
	//- ИнфоСофт Заварин К.В. 13.03.25 УА #89418
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтикеткаРаспечатана Тогда
			Элементы.ДеревоЗаказы.Свернуть(Строка.ПолучитьИдентификатор());
		Иначе	
			Элементы.ДеревоЗаказы.Развернуть(Строка.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ Тогда
		
		ТекущийОбъект.Товары.Очистить();
		
		Дерево = РеквизитФормыВЗначение("ДеревоЗаказы");
		ПреобразоватьДеревоВТаблицуЗначений(Дерево, ТекущийОбъект);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураШтрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(СтруктураШтрихкод.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ЗаполнитьДанныеЗаказа();
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

#КонецОбласти 

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВвестиШтрихкодВручную(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336	
	//ШтрихкодированиеИСКлиент.ПоказатьВводШтрихкода(Оповещение);
	ИС_MP_МаркировкаКлиент.ПоказатьВводШтрихкода(Оповещение);
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура Подключаемый_ОткрытьФормуУточненияДанных() Экспорт		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка штрихкода завершилось с ошибкой! Данные не найдены по штрихкоду!");
	Возврат;		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997     

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Функция ОписаниеОповещенияОбработкиКодаМаркировки()	
	Возврат Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение", ЭтотОбъект);	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(Результат, Параметры) Экспорт 	
	ВыполнитьПроверкуНаПечать(Результат);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод)
	
	//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418 
	Если Не СканированиеДоступно Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 13.03.25 УА #89418
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Штрихкод));
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	//+ ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	//+ ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	ПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ", Ложь);
	//- ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
	
	ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода);
	
	//ИС_MP_МаркировкаКлиент.ОбработатьДанныеШтрихкода("ОбработатьШтрихкодыЗавершение", ЭтаФорма, ДанныеШтрихкода);
	//- ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Данные, ДополнительныеПараметры) Экспорт
	
	Если Данные.Штрихкод <> "" Тогда
		ОбработатьШтрихкоды(СокрЛП(Данные.Штрихкод));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоЗаказы.ЭтикеткаРаспечатана");
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЗаказы.Имя);
	ОформляемоеПоле.Использование = Истина;
	
КонецПроцедуры

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПреобразоватьДеревоВТаблицуЗначений(ДеревоЗначений, ТекущийОбъект)
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Если Строка.Строки.Количество() = 0 Тогда
			
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
		ИначеЕсли Строка.Строки.Количество() > 0 Тогда
			
			ПреобразоватьДеревоВТаблицуЗначений(Строка, ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ЗаполнитьДеревоНоменклатурыПоТЧ()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_УпаковкаТоваровТовары.Заказ КАК Заказ,
		|	ИС_Ozon_УпаковкаТоваровТовары.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_УпаковкаТоваровТовары.Характеристика КАК Характеристика,
		|	ИС_Ozon_УпаковкаТоваровТовары.КоличествоЗаказ КАК КоличествоЗаказ,
		|	ИС_Ozon_УпаковкаТоваровТовары.КоличествоФакт КАК КоличествоФакт,
		|	ИС_Ozon_УпаковкаТоваровТовары.ЭтикеткаРаспечатана КАК ЭтикеткаРаспечатана
		|ИЗ
		|	Документ.ИС_Ozon_УпаковкаТоваров.Товары КАК ИС_Ozon_УпаковкаТоваровТовары
		|ГДЕ
		|	ИС_Ozon_УпаковкаТоваровТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(КоличествоЗаказ),
		|	СУММА(КоличествоФакт),
		|	МИНИМУМ(ЭтикеткаРаспечатана)
		|ПО
		|	Заказ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДеревоЗаказы");
 
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ЗаполнитьДанныеЗаказа()
	
	Если ДеревоЗаказы.ПолучитьЭлементы().Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеЗаполнениеТаблицы", ЭтотОбъект);
		ТекстВопроса = "Перезаполнить таблицу? Данные в табличной части будут утеряны.";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДанныеЗаказаНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПоказатьВопросЗавершениеЗаполнениеТаблицы(Результат, Объект) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеЗаказаНаСервере();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ЗаполнитьДанныеЗаказаНаСервере(МассивЗаказов = Неопределено)
	
	Объект.Товары.Очистить();
	ДеревоЗаказы.ПолучитьЭлементы().Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Заварин К.В. 21.02.25 УА #73904
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_deliver)
	|	И &ОтборЗаказов
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	И НЕ ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.ЗаказФБО
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Заказ,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	СУММА(ИС_Ozon_Заказproducts.quantity) КАК КоличествоЗаказ,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркируемыйТовар
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|			И ИС_Ozon_Заказproducts.Ссылка.Профиль = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СборочныеЗадания.Заказ КАК Ссылка
	|			ИЗ
	|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Заказproducts.Ссылка,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Заказ КАК Заказ,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.КоличествоЗаказ КАК КоличествоЗаказ,
	|	0 КАК КоличествоФакт,
	|	""Ложь"" КАК ЭтикеткаРаспечатана,
	|	ВТ_Номенклатура.МаркируемыйТовар КАК МаркируемыйТовар,
	|	ВЫБОР
	|		КОГДА ИС_MP_ДанныеВыгрузкиКИЗов.КоличествоВыгруженныхТоваров >= ВТ_Номенклатура.КоличествоЗаказ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркировкаПередана
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ДанныеВыгрузкиКИЗов КАК ИС_MP_ДанныеВыгрузкиКИЗов
	|		ПО ВТ_Номенклатура.Номенклатура = ИС_MP_ДанныеВыгрузкиКИЗов.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ИС_MP_ДанныеВыгрузкиКИЗов.Характеристика
	|			И ВТ_Номенклатура.Заказ = ИС_MP_ДанныеВыгрузкиКИЗов.ЗаказМП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|ИТОГИ
	|	СУММА(КоличествоЗаказ)
	|ПО
	|	Заказ";
	//- ИнфоСофт Заварин К.В. 21.02.25 УА #73904
	
	Если МассивЗаказов = Неопределено ИЛИ МассивЗаказов.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ОтборЗаказов", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗаказов", "ИС_Ozon_СтатусыСборочныхЗаданий.Заказ В(&МассивЗаказов)");
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДеревоЗаказы");	
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520	

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода)
	
	//+ ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955	
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	//ДанныеШтрихкода = РезультатОбработкиШтрихкода;
	//- ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
	
	РезультатРазбора = РазборКодаМаркировкиНаСервере(ДанныеШтрихкода.НормализованныйШтрихкод);
	
	Если РезультатРазбора <> Неопределено Тогда
		ДанныеШтрихкодаУпаковки = ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора);
		ДанныеШтрихкода = ДанныеШтрихкодаУпаковки;
	Иначе
		ДанныеШтрихкодаУпаковки = Неопределено;
	КонецЕсли;
	
	Если ДанныеШтрихкодаУпаковки = Неопределено И Не ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура) Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ЗвукШтрихкодОтстутствуетВБазе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдены данные по коду " + ДанныеШтрихкода.Штрихкод);
		Возврат;		
	КонецЕсли;	

	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	ТекущийЗаказ = Неопределено;
	СтрокаДанныеСборки = Неопределено;   
	
	Для Каждого Заказ Из Дерево Цикл
		
		СтрокиЗаказа = Заказ.ПолучитьЭлементы();
		
		Если СтрокиЗаказа.Количество() > 0 Тогда 
			
			Для Каждого Строка Из СтрокиЗаказа Цикл 
				
				Если Строка.Номенклатура = ДанныеШтрихкода.Номенклатура И Строка.Характеристика = ДанныеШтрихкода.Характеристика И Не Строка.ЭтикеткаРаспечатана Тогда
					
					ТекущийЗаказ = Заказ;
					СтрокаДанныеСборки = Строка;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтрокаДанныеСборки <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если СтрокаДанныеСборки = Неопределено Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 	 
		ЗвукТоварОтсутствуетВЗаказе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.");
		Возврат;
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	Иначе	
		ЗвукТоварНайден();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	КонецЕсли;	
	
	ЭтикеткаРаспечатана = Ложь;
	
	СтрокаДанныеСборки.КоличествоФакт = СтрокаДанныеСборки.КоличествоФакт + 1;
	ТекущийЗаказ.КоличествоФакт       = ТекущийЗаказ.КоличествоФакт + 1;
	
	//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90553
	Элементы.ДеревоЗаказы.ТекущаяСтрока  = СтрокаДанныеСборки.ПолучитьИдентификатор();
	//- ИнфоСофт Заварин К.В. 09.01.25 УА #90553
	
	//+ ИнфоСофт Заварин К.В. 12.03.25 УА #89418
	Если Объект.СобиратьПозаказно И Не ТекущийЗаказ.КоличествоФакт = ТекущийЗаказ.КоличествоЗаказ Тогда
		
		ДанныеСтроки = Новый Структура;
		
		ДанныеСтроки.Вставить("Заказ", 			СтрокаДанныеСборки.Заказ);
		ДанныеСтроки.Вставить("КоличествоФакт", СтрокаДанныеСборки.КоличествоФакт); 
		ДанныеСтроки.Вставить("Номенклатура", 	СтрокаДанныеСборки.Номенклатура);
		ДанныеСтроки.Вставить("Характеристика", СтрокаДанныеСборки.Характеристика);
		
		НоменклатураОтправлений = ПолучитьНоменклатуруОтправленийНасервере(ДанныеСтроки);
		
		СтрокаДанныеСборки.КоличествоФакт = 0;
		ТекущийЗаказ.КоличествоФакт       = 0;
		
		ДанныеСборки = Новый Структура;
		ДанныеСборки.Вставить("НоменклатураОтправлений", НоменклатураОтправлений);
		
		Оповещение = Новый ОписаниеОповещения("ПолучитьРезультатОбработкиОтправления", ЭтотОбъект); 
		
		СканированиеДоступно = Ложь;
		
		ОткрытьФорму("Документ.ИС_Ozon_УпаковкаТоваров.Форма.ФормаОтправления", ДанныеСборки, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	Иначе
		//- ИнфоСофт Заварин К.В. 13.03.25 УА #89418
		
		Если СтрокаДанныеСборки.КоличествоФакт = СтрокаДанныеСборки.КоличествоЗаказ Тогда
			
			НужноПечатать = Истина;
			СтрокаДанныеСборки.ЭтикеткаРаспечатана = Истина;
			
			СтрокиПоЗаказу = ТекущийЗаказ.ПолучитьЭлементы();
			
			Если СтрокиПоЗаказу.Количество() > 1 Тогда
				
				Для Каждого Строка Из СтрокиПоЗаказу Цикл
					
					Если Строка.КоличествоФакт <> Строка.КоличествоЗаказ Тогда				
						НужноПечатать = Ложь;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НужноПечатать Тогда
				
				Попытка 
					
					//+ ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
					Если ПечататьШтрихкоды Тогда  
						
						Если ЗначениеЗаполнено(Объект.НастройкиПечатиШтрихкодов) Тогда
							//+ УТ
							КоличествоКопий = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.НастройкиПечатиШтрихкодов, "КоличествоКопий");
							//- УТ
							ЭтикеткаШтрихкода = ВыполнитьПечатьШтрихкода(ДанныеШтрихкода.Штрихкод);
							ВыполнитьНастройкуТабличногоДокумента(ЭтикеткаШтрихкода, Объект.НастройкиПечатиШтрихкодов);
							
							Для СЧ = 1 По КоличествоКопий Цикл
								ЭтикеткаШтрихкода.Напечатать();
							КонецЦикла;
							
						Иначе
							ЭтикеткаШтрихкода = ВыполнитьПечатьШтрихкода(ДанныеШтрихкода.Штрихкод);
							ЭтикеткаШтрихкода.Напечатать();
						КонецЕсли; 
						
					КонецЕсли;
					//- ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
					
					ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки); 
					
					ТекущийЗаказ.ЭтикеткаРаспечатана = ЭтикеткаРаспечатана;
					
					Элементы.ДеревоЗаказы.Свернуть(ТекущийЗаказ.ПолучитьИдентификатор());
					
				Исключение
					ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 12.03.25 УА #89418
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаКлиенте
Процедура ПолучитьРезультатОбработкиОтправления(Результат, ДополнительныеПараметры) Экспорт
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	Если Не Результат = Неопределено И Результат.ТоварыПодобраны Тогда
		
		Для Каждого Заказ Из Дерево Цикл
			
			СтрокиЗаказа = Заказ.ПолучитьЭлементы();
			
			Если СтрокиЗаказа.Количество() > 0 Тогда 
				
				Для Каждого Строка Из СтрокиЗаказа Цикл 
					
					Если Строка.Заказ = Результат.Отправление Тогда
						
						Заказ.КоличествоФакт 	   = Заказ.КоличествоЗаказ;
						Заказ.ЭтикеткаРаспечатана  = Истина;
						
						Строка.КоличествоФакт 	   = Строка.КоличествоЗаказ;
						Строка.ЭтикеткаРаспечатана = Истина;
						
						Попытка	
							Элементы.ДеревоЗаказы.Свернуть(Заказ.ПолучитьИдентификатор());
							ВыполнитьПечатьЭтикетки(Строка);	
						Исключение
							ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						КонецПопытки;		
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("РазрешитьСканирование", 2, Истина);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаКлиенте
Процедура РазрешитьСканирование()
	СканированиеДоступно = Истина;	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаСервере
Функция ПолучитьНоменклатуруОтправленийНаСервере(ДанныеСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_deliver)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = &Заказ
	|	И НЕ ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.ЗаказФБО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Отправление,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon КАК НоменклатураOzon,
	|	ИС_Ozon_Заказproducts.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	СУММА(ИС_Ozon_Заказproducts.quantity) КАК Количество,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура = &Номенклатура
	|				И ИС_Ozon_СоответствиеХарактеристик.Характеристика = &Характеристика
	|			ТОГДА &КоличествоФакт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоФакт
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|			И ИС_Ozon_Заказproducts.Ссылка.Профиль = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СборочныеЗадания.Заказ КАК Ссылка
	|			ИЗ
	|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Заказproducts.Ссылка,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon,
	|	ИС_Ozon_Заказproducts.ХарактеристикаOzon";
	
	Запрос.УстановитьПараметр("Заказ", ДанныеСтроки.Заказ);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль); 
	Запрос.УстановитьПараметр("КоличествоФакт", ДанныеСтроки.КоличествоФакт);
	Запрос.УстановитьПараметр("Номенклатура", ДанныеСтроки.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ДанныеСтроки.Характеристика);
	   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат);
	
КонецФункции //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки) 
	
	МассивЭтикеток = ПолучитьЭтикеткиНаСервере(СтрокаДанныеСборки.Заказ);
	
	Если МассивЭтикеток.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить этикетки с сервера Ozon!");
		Возврат;
	КонецЕсли;
	
	Этикетка = МассивЭтикеток[0];
	
	Если ЗначениеЗаполнено(Объект.НастройкаПечатиЭтикеток) Тогда 		
		ПринтерДляПечати = """" + ПолучитьПринтерДляПечати() + """";
	Иначе	
		ПринтерДляПечати = "";
	КонецЕсли;
	
	ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов();
	
	ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + "stickersFile.pdf";

	Этикетка.Записать(ИмяВременногоФайла);
	
	ИС_МП_Клиент.НапечататьИзПриложения(ИмяВременногоФайла, ПринтерДляПечати);

	ЭтикеткаРаспечатана = Истина;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьЭтикеткиНаСервере(СборочноеЗадание)

	МассивЗаданий = Новый Массив;
	МассивЗаданий.Добавить(СборочноеЗадание);
	
	Возврат ИС_Ozon_Сервер.НапечататьЭтикетки(Объект.Профиль, МассивЗаданий);
	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", РезультатРазбора.НормализованныйКодМаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Номенклатура", Выборка.Номенклатура);
	Результат.Вставить("Характеристика", Выборка.Характеристика);
	Результат.Вставить("НормализованныйШтрихкод", РезультатРазбора.КодМаркировки); 
	Результат.Вставить("ШтрихкодУпаковки", Выборка.Ссылка);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьПринтерДляПечати()	
	Возврат Объект.НастройкаПечатиЭтикеток.ИмяПринтера;	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция РазборКодаМаркировкиНаСервере(НормализованныйШтрихкод)	
	Возврат ИС_MP_Маркировка.РазборКодаМаркировки(НормализованныйШтрихкод);	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПолучитьЗначениеПараметра()
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("ПроигрыватьЗвукиПриСканировании");
		
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Объект.Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивНаименованийПараметров);
	
	//+ ИнфоСофт Власова И.С. 04.02.25 УА #92991
	//Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") Тогда
	Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") И Не Настройки.ПроигрыватьЗвукиПриСканировании = Неопределено Тогда
	//- ИнфоСофт Власова И.С. 04.02.25 УА #92991
		Возврат Настройки.ПроигрыватьЗвукиПриСканировании;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762


//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 
//Реализован функционал воспроизведения дополнительного звука при сканировании товаров в документе "УпаковкаТоваров"
&НаКлиенте
Процедура ПроигратьЗвук(ИмяФайла) 
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	//+ ИнфоСофт Власова И.С. 27.01.25 УА #91984
	//Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
	//	Или Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		И Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 27.01.25 УА #91984
	
	Константа = ПолучитьЗначениеПараметра(); 
	
	Если Константа Тогда  
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварНайден()
	
	ИмяФайла = КаталогДокументов() + "scanOK.wav";
	ПроигратьЗвук(ИмяФайла);
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварОтсутствуетВЗаказе()
	
	ИмяФайла = КаталогДокументов() + "scanAlarm.wav";
	ПроигратьЗвук(ИмяФайла); 
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукШтрихкодОтстутствуетВБазе()
	ИмяФайла = КаталогДокументов() + "scanERROR.wav";
	ПроигратьЗвук(ИмяФайла); 	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
&НаСервере
Функция ВыполнитьПечатьШтрихкода(Штрихкод)
	
	Данные = ПолучитьДанныеДляФормированияШтрихкода(Штрихкод);
	
	Если ТипШтрихкода = 0 Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_УпаковкаТоваров.ПФ_MXL_Штрихкод58х40_Ozon");
	ИначеЕсли ТипШтрихкода = 1 Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_УпаковкаТоваров.ПФ_MXL_Штрихкод43х25_Ozon");
	ИначеЕсли ТипШтрихкода = 2 Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_УпаковкаТоваров.ПФ_MXL_Штрихкод30х20_Ozon");
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетка";		
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("Этикетка"); 
	
	ОбластьМакетаОсновныеДанные.Параметры.Заполнить(Данные);
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	
	ПараметрыШК.Ширина = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
	ПараметрыШК.Высота = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
	ПараметрыШК.РазмерШрифта = 10;
	ПараметрыШК.ТипКода = Кодировка;
	ПараметрыШК.Штрихкод = Штрихкод;
	ПараметрыШК.Масштабировать = Истина;
	ПараметрыШК.СохранятьПропорции = Истина;
	ПараметрыШК.ВертикальноеВыравнивание = 2;
	
	СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
	
	Если СтруктураКартинки.Результат Тогда	
		ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
	КонецЕсли;  
	
	ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648

//+ ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
&НаСервере
Функция ПолучитьДанныеДляФормированияШтрихкода(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.offer_id КАК offer_id,
	|	ИС_Ozon_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_Ozon_Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ПО ИС_Ozon_Штрихкоды.Владелец = ИС_Ozon_Номенклатура.Ссылка
	|ГДЕ
	|	ИС_Ozon_Штрихкоды.Наименование = &Штрихкод
	|	И ИС_Ozon_Штрихкоды.ЛичныйКабинет = &Профиль";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Результат.Вставить("Штрихкод", ВыборкаДетальныеЗаписи.Штрихкод);
		Результат.Вставить("Артикул", ВыборкаДетальныеЗаписи.offer_id); 		
		Результат.Вставить("Наименование", ВыборкаДетальныеЗаписи.Ссылка.Наименование);                                   
		
	КонецЦикла;  
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648

//+ ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
&НаСервереБезКонтекста
Процедура ВыполнитьНастройкуТабличногоДокумента(Этикетка, НастройкиПечати)
	
	Этикетка.ИмяПринтера = НастройкиПечати.ИмяПринтера; 
	Этикетка.ПолеСлева = НастройкиПечати.Слева;
	Этикетка.ПолеСправа = НастройкиПечати.Справа;
	Этикетка.ПолеСнизу = НастройкиПечати.Снизу;
	Этикетка.ПолеСверху = НастройкиПечати.Сверху;	
	Этикетка.РазмерКолонтитулаСверху = НастройкиПечати.КолонтитулыСверху;
	Этикетка.РазмерКолонтитулаСнизу = НастройкиПечати.КолонтитулыСнизу; 
	Этикетка.ЭкземпляровНаСтранице = НастройкиПечати.ЭкземпляровНаСтраницу; 
	
	Если НастройкиПечати.ОриентацияСтраницы = 0 Тогда 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
		
	Если НастройкиПечати.Масштаб = 0 Тогда 
		Этикетка.АвтоМасштаб = Истина;
	Иначе 
		Этикетка.АвтоМасштаб = Ложь;
		Этикетка.МасштабПечати = НастройкиПечати.МасштабЗначение;	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648

#КонецОбласти
